In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
A=[1,3,6,7,np.nan,9]

pd.Series(A)

0    1.0
1    3.0
2    6.0
3    7.0
4    NaN
5    9.0
dtype: float64

In [31]:
dates=pd.date_range('20130101', periods=6)
print(dates)
df=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))
print(df)


df2 = pd.DataFrame({ 'A' : 1.,
                       'B' : pd.Timestamp('20130102'),
                        'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                       'E' : pd.Categorical(["test","train","test","train"]),
                         'F' : 'foo' })


#df2=pd.DataFrame({'A':1,'B': 'this','C':'foo'})
print(df2)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-04 -1.160131  0.144677 -1.303987  0.094663
2013-01-05 -0.181734  0.586402  0.816664  0.039328
2013-01-06  0.380586 -0.349982 -1.122404  0.919243
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [24]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [23]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [28]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [33]:
df.values

array([[ 1.46320754, -0.62306018, -0.96831607, -0.62669505],
       [-0.37376874,  2.21019688,  0.43525355,  1.54337796],
       [ 1.52953362,  1.59789269,  0.30647789,  0.06545818],
       [-1.16013111,  0.14467704, -1.30398696,  0.09466301],
       [-0.18173442,  0.5864016 ,  0.81666413,  0.03932829],
       [ 0.38058627, -0.3499822 , -1.12240375,  0.91924344]])

In [34]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.276282  0.594354 -0.306052  0.339229
std    1.066390  1.113030  0.925864  0.767347
min   -1.160131 -0.623060 -1.303987 -0.626695
25%   -0.325760 -0.226317 -1.083882  0.045861
50%    0.099426  0.365539 -0.330919  0.080061
75%    1.192552  1.345020  0.403060  0.713098
max    1.529534  2.210197  0.816664  1.543378

In [38]:
df.sort_index(axis=1,ascending=True)

                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-04 -1.160131  0.144677 -1.303987  0.094663
2013-01-05 -0.181734  0.586402  0.816664  0.039328
2013-01-06  0.380586 -0.349982 -1.122404  0.919243

In [41]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-06  0.380586 -0.349982 -1.122404  0.919243
2013-01-04 -1.160131  0.144677 -1.303987  0.094663
2013-01-05 -0.181734  0.586402  0.816664  0.039328
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-02 -0.373769  2.210197  0.435254  1.543378

In [43]:
df['B']

2013-01-01   -0.623060
2013-01-02    2.210197
2013-01-03    1.597893
2013-01-04    0.144677
2013-01-05    0.586402
2013-01-06   -0.349982
Freq: D, Name: B, dtype: float64

In [46]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458

In [49]:
df.loc[dates[0]]

A    1.463208
B   -0.623060
C   -0.968316
D   -0.626695
Name: 2013-01-01 00:00:00, dtype: float64

In [51]:
df.loc[dates[0],['A','B']]

A    1.463208
B   -0.623060
Name: 2013-01-01 00:00:00, dtype: float64

In [59]:
df.loc[dates[1],['A','C']]
df.loc[[dates[0],dates[2]]]
df.loc[[dates[0],dates[2]],['A','D']]

                   A         D
2013-01-01  1.463208 -0.626695
2013-01-03  1.529534  0.065458

In [53]:
df.at[dates[0],'A']

1.4632075414472268

In [60]:
df

                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-04 -1.160131  0.144677 -1.303987  0.094663
2013-01-05 -0.181734  0.586402  0.816664  0.039328
2013-01-06  0.380586 -0.349982 -1.122404  0.919243

In [65]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.160131  0.144677
2013-01-05 -0.181734  0.586402

In [67]:
df.iloc[1:3]
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458

In [68]:
df.iloc[1,1]

2.2101968819952629

In [69]:
df[df.A>0]

                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-06  0.380586 -0.349982 -1.122404  0.919243

In [70]:
df.A

2013-01-01    1.463208
2013-01-02   -0.373769
2013-01-03    1.529534
2013-01-04   -1.160131
2013-01-05   -0.181734
2013-01-06    0.380586
Freq: D, Name: A, dtype: float64

In [71]:
df.B

2013-01-01   -0.623060
2013-01-02    2.210197
2013-01-03    1.597893
2013-01-04    0.144677
2013-01-05    0.586402
2013-01-06   -0.349982
Freq: D, Name: B, dtype: float64

In [72]:
df[df>0]

                   A         B         C         D
2013-01-01  1.463208       NaN       NaN       NaN
2013-01-02       NaN  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-04       NaN  0.144677       NaN  0.094663
2013-01-05       NaN  0.586402  0.816664  0.039328
2013-01-06  0.380586       NaN       NaN  0.919243

In [73]:
df

                   A         B         C         D
2013-01-01  1.463208 -0.623060 -0.968316 -0.626695
2013-01-02 -0.373769  2.210197  0.435254  1.543378
2013-01-03  1.529534  1.597893  0.306478  0.065458
2013-01-04 -1.160131  0.144677 -1.303987  0.094663
2013-01-05 -0.181734  0.586402  0.816664  0.039328
2013-01-06  0.380586 -0.349982 -1.122404  0.919243